tutorials/PitchingAirfoil/NACA64A010/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/elisa/TESI/MESHES";
    case "NACA64A010";
    instance "constant";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
inlet-outlet
{
    type patch;
    physicalType supersonicInlet;
    nFaces 21;
    startFace 4268;
}

body
{
    type patch;
    physicalType transpiration;
    nFaces 203;
    startFace 4289;
}

defaultFaces
{
    type empty;
    physicalType empty;
    nFaces 5840;
    startFace 4492;
}
)

// ************************************************************************* //
